Revit 2027 API
RebarUpdateCurvesData.IsStartConstraintChanged Property
 Indicates if the start handle constraint has changed since the last regeneration.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsStartConstraintChanged { get; }
Public ReadOnly Property IsStartConstraintChanged As Boolean
	Get
public:
property bool IsStartConstraintChanged {
	bool get ();
}
member IsStartConstraintChanged : bool with get
Property Value
Boolean
See Also
Reference
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace